"UI_PANE_LOGIN"       = "Login";
"UI_PANE_DISPLAY"     = "Display";
"UI_PANE_KEYBOARD"    = "Keyboard";
"UI_PANE_SOUND"       = "Sound";
"UI_PANE_DRIVES"      = "Drives";
"UI_PANE_PRINTERS"    = "Printers";
"UI_PANE_APPLICATIONS"= "Applications";
"UI_PANE_SECURITY"    = "Security";

"UI_SECONDARY_MOUSE_BUTTON"  = "Secondary Mouse Button";
"UI_ALT_KEY"            = "Alt Key";
"UI_WINDOWS_START_KEY"  = "Windows Start Key" ;
"UI_CONTEXT_MENU_KEY"   = "Context Menu Key";
"UI_PAUSE_BREAK_KEY"    = "Pause/Break Key";
"UI_PRINT_SCREEN_KEY"   = "Print Screen Key" ;
"UI_NUM_LOCK_KEY"       = "Num Lock Key";
"UI_SCROLL_LOCK_KEY"    = "Scroll Lock";

"UI_HALF_FULL_WIDTH_KEY"= "Half/Full Width Key";
"UI_HIRAGANA_KEY"       = "Hiragana Key";
"UI_ALPHANUMERIC_KEY"   = "Alphanumeric Key";
"UI_CONVERSION_KEY"     = "Conversion Key";
"UI_NON_CONVERSION_KEY" = "Non-Conversion Key";

"UI_ALTGR_KEY"          = "AltGr Key";

"DEFAULT_FILENAME"        = "Default";
"CONNECTION_FILE_EXT"     = "rdp";
"CONNECTION_FILE_EXT_V1"  = "";
"DEFAULT_DIRECTORY_NAME"  = "RDC Connections";

"UI_OK"                    = "OK";
"UI_CANCEL"                = "Cancel";
"UI_YES"                   = "Yes";
"UI_NO"                    = "No";
"UI_CONNECT"               = "Connect";
"UI_RECONNECT"             = "Reconnect";
"UI_DISCONNECT"            = "Disconnect";

"UI_FAILED_TO_SAVE_FILE"  = "Cannot save %@.";
"UI_FAILED_TO_SAVE_FILE_INFORMATIVE" = "Make sure that you have permission to write to the location where you want to save the file.";

"UI_FAILED_TO_OPEN_FILE"  = "Cannot open %@.";
"UI_FAILED_TO_OPEN_FILE_INFORMATIVE" = "Make sure that the file exists and that you have permission to read the file.";

"UI_MISSING_COMPUTER_NAME" = "The changes that you have made cannot be saved to the connection file %@.";
"UI_MISSING_COMPUTER_NAME_INFORMATIVE" = "Connection settings require a computer name.\n\nIn the Remote Desktop Connection window, type a computer name, and then try saving the connection file again.";

"UI_QUIT_WITHOUT_SAVING" = "Quit Without Saving";

"UI_SAVE_DIALOG_TITLE"    = "Save: RDC";

"UI_OPEN_DIALOG_TITLE"    = "Open: RDC";

"UI_ALL_PRINTERS"         = "All printers";

"UI_SELECT"               = "Select";

"UI_APP_NAME"             = "Microsoft® Remote Desktop Connection Client for Mac";

"UI_MAIN_DISPLAY"         = "Main display";
"UI_SECONDARY_DISPLAY"    = "Secondary display";
"UI_TERIARY_DISPLAY"      = "Tertiary display";
"UI_FOURTH_DISPLAY"       = "Fourth display";
"UI_FIFTH_DISPLAY"        = "Fifth display";
"UI_DISPLAY_NUMBER"       = "Display %d";

"UI_ALERT_DRIVES_REDIRECTION_MESSAGE_TEXT"     = "You are sharing your Mac hard disks with a Windows-based computer.";
"UI_ALERT_DRIVES_REDIRECTION_INFOMATIVE_TEXT"  = "Someone with access to your Windows-based computer can open your Mac disk drives and folders. This is potentially unsafe.";

"UI_SERVER_DENIED_CONNECTION"             = "The remote computer is not allowing connections from the Mac.";
"UI_SERVER_DENIED_CONNECTION_INFORMATIVE" = "Make sure that you have permission to connect to the remote computer, and that you typed the correct credentials.\n\nContact your administrator, or the owner of the remote computer for assistance.";

"UI_BAD_SERVER_NAME"                      = "The Mac cannot connect because the Windows-based computer cannot be found.";
"UI_BAD_SERVER_NAME_INFORMATIVE"          = "Verify that you typed the correct computer name or IP address, and try connecting again.";

"UI_CLIENT_LOW_MEMORY"                    = "The Mac is low on memory and cannot connect to the Windows-based computer.";
"UI_CLIENT_LOW_MEMORY_INFORMATIVE"        = "Quit some applications, and then try connecting to the Windows-based computer again.";

"UI_AUTHENTICATION_ERROR"                 = "Remote Desktop Connection cannot verify the identity of the computer that you want to connect to.";
"UI_AUTHENTICATION_ERROR_INFORMATIVE"     = "Try reconnecting to the Windows-based computer, or contact our administrator.";

"UI_GENERAL_CONNECTION_FAILURE"           = "The Mac cannot connect to the Windows-based computer.";
"UI_GENERAL_CONNECTION_FAILURE_INFORMATIVE" = "This problem can occur if:\n • The Windows-based computer is not set up to accept remote connections.\n • The Windows-based computer is not turned on.\n • The Mac, or the Windows-based computer is experiencing network problems.\n\nTry connecting to the Windows-based computer again, or contact your administrator.";

"UI_DISCONNECT_BY_CLIENT"                 = "You are disconnecting the Windows-based computer.";
"UI_DISCONNECT_BY_CLIENT_INFORMATIVE"     = "If you disconnect, any applications still running on the Windows-based computer will continue to run while you are disconnected.\n\nIf you do not want to disconnect, click Cancel.";

"UI_DISCONNECT_BY_SERVER"                 = "You were disconnected from the Windows-based computer.";
"UI_DISCONNECT_BY_SERVER_INFORMATIVE"     = "Someone with access to the Windows-based computer may have ended the connection, or the Windows-based computer has dropped the connection.\n\nTry reconnecting to the Windows-based computer, or contact your administrator.";

"UI_DISCONNECT_BY_LOGON_TIMEOUT"          = "You were disconnected from the Windows-based computer.";
"UI_DISCONNECT_BY_LOGON_TIMEOUT_INFORMATIVE" = "The remote session has timed out.\n\nTry reconnecting to the Windows-based computer, or contact your administrator.";

"UI_DISCONNECT_BY_OTHER_CONNECTION"       = "You were disconnected from the Windows-based computer.";
"UI_DISCONNECT_BY_OTHER_CONNECTION_INFORMATIVE" = "Another user has connected to the Windows-based computer.\n\nTry reconnecting to the Windows-based computer.";

"UI_DISCONNECT_BY_LICENSE"                = "You were disconnected from the Windows-based computer because of problems during the licensing protocol.";
"UI_DISCONNECT_BY_LICENSE_INFORMATIVE"    = "Try reconnecting to the Windows-based computer, or contact your administrator.";

"UI_DISCONNECT_BY_PROTOCOL_ERROR"         = "You were disconnected from the Windows-based computer.";
"UI_DISCONNECT_BY_PROTOCOL_ERROR_INFORMATIVE" = "The problem might be temporary.\n\nTry reconnecting to the Windows-based computer, or contact your administrator.";

"UI_CONNECTION_BROKEN"                    = "You were disconnected from the Windows-based computer because of network problems.";
"UI_CONNECTION_BROKEN_INFORMATIVE"        = "Verify that your network and Internet connections are working, and then try reconnecting to the Windows-based computer.";

"UI_RANDOM_UNEXPECTED"                    = "The connection to the Windows-based computer ended unexpectedly.";
"UI_RANDOM_UNEXPECTED_INFORMATIVE"        = "Try closing and opening Remote Desktop Connection again.";

"UI_NEED_TIGER"                           = "Remote Desktop Connection cannot run on the operating system that is installed on your computer.";
"UI_NEED_TIGER_INFORMATIVE"               = "Upgrade to Mac OS X 10.4.9 or a later version, and then try running Remote Desktop Connection again.";

"UI_COMFIRM_SAVE_PREFERENCE"              = "The changes that you have made have not been saved to the connection file %@.";
"UI_COMFIRM_SAVE_PREFERENCE_INFORMATIVE"  = "Do you want to save the changes to %@?";

"UI_SAVE"                  = "Save";
"UI_DONTSAVE"              = "Don't Save";

"UI_ALERT_DONT_SHOW"					  = "Don't show this message again when connecting to %@";

